34/feature.SOAP_POST.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:feature\/SOAP_POST.feature","packageQualifiedName":"feature.SOAP_POST","loopIndex":-1,"relativePath":"feature\/SOAP_POST.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":395105,"millis":0.395105,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":1023813,"millis":1.023813,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":451805,"millis":0.451805,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":607907,"millis":0.607907,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":414974813,"millis":414.974813,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":354604,"millis":0.354604,"status":"passed"},"step":{"line":11,"prefix":"Given","index":0,"text":"request body"}},{"result":{"nanos":868450700,"millis":868.4507,"status":"passed"},"step":{"line":12,"prefix":"When","index":1,"text":"soap action 'NumberToWords'"},"stepLog":"23:57:30.459 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>500<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:57:30.807 response time in milliseconds: 347\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:57:30 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>five hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":7300,"millis":0.0073,"status":"passed"},"step":{"line":13,"prefix":"Then","index":2,"text":"status 200"}},{"result":{"nanos":8419904,"millis":8.419904,"status":"passed"},"step":{"line":14,"prefix":"And","index":3,"text":"print response"},"stepLog":"23:57:30.817 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>five hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1631020,"millis":1.63102,"status":"passed"},"step":{"line":15,"prefix":"And","index":4,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'five hundred'"}}],"executorName":"pool-1-thread-1","line":10,"name":"Sample POST","description":"","durationMillis":1296.316971,"startTime":1691798249522,"failed":false,"refId":"[1:10]","endTime":1691798250819,"exampleIndex":-1},{"sectionIndex":1,"stepResults":[{"result":{"nanos":379805,"millis":0.379805,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":357105,"millis":0.357105,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":804810,"millis":0.80481,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":599407,"millis":0.599407,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":407557421,"millis":407.557421,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":277946924,"millis":277.946924,"status":"passed"},"step":{"line":18,"prefix":"*","index":0,"text":"set body\/Envelope\/Body\/NumberToWords\/ubiNum = 300"}},{"result":{"nanos":245503,"millis":0.245503,"status":"passed"},"step":{"line":19,"prefix":"Given","index":1,"text":"request body"}},{"result":{"nanos":566126675,"millis":566.126675,"status":"passed"},"step":{"line":20,"prefix":"When","index":2,"text":"soap action 'NumberToWords'"},"stepLog":"23:57:30.457 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>300<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:57:30.784 response time in milliseconds: 327\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:57:30 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>three hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":6900,"millis":0.0069,"status":"passed"},"step":{"line":21,"prefix":"Then","index":3,"text":"status 200"}},{"result":{"nanos":9794621,"millis":9.794621,"status":"passed"},"step":{"line":22,"prefix":"And","index":4,"text":"print response"},"stepLog":"23:57:30.796 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>three hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":20320651,"millis":20.320651,"status":"passed"},"step":{"line":23,"prefix":"And","index":5,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'three hundred'"}}],"executorName":"pool-1-thread-5","line":17,"name":"Sample POST after updating xml file content","description":"","durationMillis":1284.139822,"startTime":1691798249532,"failed":false,"refId":"[2:17]","endTime":1691798250817,"exampleIndex":-1}],"callDepth":0,"name":"SOAP Sample POST","description":"","resultDate":"2023-08-11 11:57:31 PM","durationMillis":2580.456793,"passedCount":2}